#encoding: utf-8
class Passgen

    def create_pass
        vowels = ['а', 'о', 'и','у','ы','е', 'ю', 'я']
        consonants = ['б', 'в', 'г', 'д', 'ж', 'з', 'к', 'л', 'м', 'н', 'п', 'р', 'с', 'т', 'ф', 'х', 'ч' ]
        result = ''
        while result.length < rand(6..7)
            if (result.length%2) == 1 then
                syl = vowels[rand(vowels.length)]
            else
                syl = consonants[rand(consonants.length)]
            end
            result += syl
        end
        return result
    end

    def create_pass_of_syllables
        syllables = [ 'ба' ,'бо' ,'би' ,'бу' ,'бы' ,'бе' ,'бю' ,'бя' ,
                       'ва' ,'во' ,'ви' ,'ву' ,'вы' ,'ве' ,'вю' ,'вя' ,
                       'га' ,'го' ,'ги' ,'гу' ,'гы' ,'ге' ,'гю' ,'гя' ,
                       'да' ,'до' ,'ди' ,'ду' ,'ды' ,'де' ,'дю' ,'дя' ,
                       'жа' ,'жо' ,'жи' ,'жу'       ,'же' ,
                       'за' ,'зо' ,'зи' ,'зу' ,'зы' ,'зе' ,'зю' ,'зя' ,
                       'ка' ,'ко' ,'ки' ,'ку' ,'кы' ,'ке' ,'кю' ,'кя' ,
                       'ла' ,'ло' ,'ли' ,'лу' ,'лы' ,'ле' ,'лю' ,'ля' ,
                       'ма' ,'мо' ,'ми' ,'му' ,'мы' ,'ме' ,'мю' ,'мя' ,
                       'на' ,'но' ,'ни' ,'ну' ,'ны' ,'не' ,'ню' ,'ня' ,
                       'па' ,'по' ,'пи' ,'пу' ,'пы' ,'пе' ,'пю' ,'пя' ,
                       'ра' ,'ро' ,'ри' ,'ру' ,'ры' ,'ре' ,'рю' ,'ря' ,
                       'са' ,'со' ,'си' ,'су' ,'сы' ,'се' ,'сю' ,'ся' ,
                       'та' ,'то' ,'ти' ,'ту' ,'ты' ,'те' ,'тю' ,'тя' ,
                       'фа' ,'фо' ,'фи' ,'фу' ,'фы' ,'фе' ,
                       'ха' ,'хо' ,'хи' ,'ху' ,'хы' ,'хе' ,
                       'ча' ,'чо' ,'чи' ,'чу' ,'чы' ,'че' ,'чю' ,'чя' ]
        sl =  syllables.length
        result = ''
        while result.length < rand(6..7)
            result += syllables[rand(sl)]
        end
        return result
    end

end